{
    "envMC": [
        {
            "text": "How would you see if you could connect to google.com?",
            "options": [
                {
                    "id": 0,
                    "text": "ssh google.com",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "ps google.com",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "ping google.com",
                    "isCorrect": true
                },
                {
                    "id": 3,
                    "text": "scp google.com",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "I want to learn all about the ls command and everything that it can do. Which command do I use to achieve that?",
            "options": [
                {
                    "id": 0,
                    "text": "whatis ls",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "man ls",
                    "isCorrect": true
                },
                {
                    "id": 2,
                    "text": "ifconfig ls",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "whereis ls",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "What does this command sequence do? Sequence: ps -fu user1 | grep pID, kill pID, jobs, bg pID",
            "options": [
                {
                    "id": 0,
                    "text": "Looks for all the processes for a user and displays them, stops a process, lists status of all active processes",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "Looks for all the processes, stops a process, lists status of all processes, brings a process from the background to the foreground",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "Looks for all the processes for a user, suspends a process, lists status of all active processes, forces a process to run in the background",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "Looks for all the processes for a user and displays them, stops a process, lists status of all active processes, forces a process to run in the background",
                    "isCorrect": true
                }
            ]
        },
        {
            "text": "What command allows you to see the type of os a machine is running?",
            "options": [
                {
                    "id": 0,
                    "text": "type -os",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "uname -a",
                    "isCorrect": true
                },
                {
                    "id": 2,
                    "text": "who",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "ifconfig -a",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "You are in account U1. You want to switch users and access account U2. What are the steps that happen to achieve that?",
            "options": [
                {
                    "id": 0,
                    "text": "Kernal, Hardware, Shell",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "whoami U2, set password, access account",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "su U2, access account",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "su U2, ask for password, access if correct",
                    "isCorrect": true
                }
            ]
        },
        {
            "text": "What does ctrl-c do?",
            "options": [
                {
                    "id": 0,
                    "text": "Suspends a process",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "Terminates a process",
                    "isCorrect": true
                },
                {
                    "id": 2,
                    "text": "Terminates an external process",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "Suspends a job for an amount of time before temrinating it",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "What does ssh stand for and when would you use it?",
            "options": [
                {
                    "id": 0,
                    "text": "socket shell, used when you need a secure connection between hosts ",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "secure shell; used when you need to see if a host is available",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "secure shell; used when you need a secure connection between hosts",
                    "isCorrect": true
                },
                {
                    "id": 3,
                    "text": "security shell; used when you need a secure connection between hosts",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "When would you use who vs. when would you use whoami?",
            "options": [
                {
                    "id": 0,
                    "text": "Why would I ever use those commands?",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "Use who when you want to see who did a certain action, use whoami when you want to switch between users",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "Use whoami when you would like to see all logged in users' information; use who when you want to see current username",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "Use who when you would like to see all logged in users' information; use whoami when you want to see current username",
                    "isCorrect": true
                }
            ]
        },
        {
            "text": "What's the similarity and difference between scp and ssh?",
            "options": [
                {
                    "id": 0,
                    "text": "Similarity: network protocols that can be used to exchange data through a secure channel between two remote devices in a network; Difference: scp is for transfering files and can use ssh, and ssh is for establishing a secure connection between two remote devices",
                    "isCorrect": true
                },
                {
                    "id": 1,
                    "text": "Similarity: network protocols that can be used to exchange data through a secure channel between two remote devices in a network; Difference: ssh is for transfering files and can use scp, and scp is for establishing a secure connection between two remote devices",
                    "isCorrect": false
                },
                {
                    "id": 2,
                    "text": "Similarity: network protocols that are both used for transfering files but in different ways; Difference: ssh provides a secure connection while scp provides a more unsecure connection",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "Similarities: file protocols that can be used to exchange data through a secure channel between two remote devices in a network; Difference: scp is for transfering files and can use ssh, and ssh is for establishing a secure connection between two remote devices",
                    "isCorrect": false
                }
            ]
        },
        {
            "text": "What is an environment variable and how do you see them?",
            "options": [
                {
                    "id": 0,
                    "text": "Environment variables describe the environment is which programs and applications run; command: en",
                    "isCorrect": false
                },
                {
                    "id": 1,
                    "text": "Environment variables describe the environment is which programs and applications run; command: env ",
                    "isCorrect": true
                },
                {
                    "id": 2,
                    "text": "Environment variables are variables used to store application data in; command: env",
                    "isCorrect": false
                },
                {
                    "id": 3,
                    "text": "I have no idea",
                    "isCorrect": false
                }
            ]
        }
    ]
}